/* 
  суть
    визначає загальний інтерфейс для створення об’єктів у суперкласі, дозволяючи підкласам змінювати тип створюваних об’єктів.
  проблема
    наприклад програама розроблялася для використання з типомПродукту1, але з часом можливо зявляться типПродукту2 і типПродукту3,
    як наслідок у коді зявляється багато залежносте йвід типу продукту
  рішення
    створити загальний інтерфейс дял суперкласу Продукт, який матиме спільні для всіх типів продукту методи і використовувати його,
    замість більш специфічного типПродуктуN
*/